#Parameters
nc: 1  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple
anchors:
  - [5,6, 8,14, 15,11]  #4
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],     # 0-P1/2
   [-1, 1, Conv, [128, 3, 1]],  # 1
   [-1,1,space_to_depth,[1]],   # 2 -P2/4
   [-1, 3, C3, [128]],          # 3 160*160
   [-1, 1, Conv, [256, 3, 1]],  # 4
   [-1,1,space_to_depth,[1]],   # 5 -P3/8
   [-1, 6, C3, [256]],          # 6 80*80
   [-1, 1, Conv, [512, 3, 1]],  # 7-P4/16
   [-1,1,space_to_depth,[1]],   # 8 -P4/16
   [-1, 9, C3, [512]],          # 9 40*40
   [-1, 1, Conv, [1024, 3, 1]], # 10-P5/32
   [-1,1,space_to_depth,[1]],   # 11 -P5/32
   [-1, 3, C3, [1024]],         # 12
   [-1, 1, SPPF, [1024, 5]],    # 13 20*20
  ]


#head
head:
  [[-1, 1, Conv, [512, 1, 1]],                    # 14   20*20          [512, 256, 1, 1]
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 15
   [[-1, 9], 1, Concat, [1]],                     # 16 cat backbone P4
   [-1, 3, C3, [512, False]],                     # 17  40*40

   [-1, 1, Conv, [512, 1, 1]],                    # 18   40*40
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 19
   [[-1, 6], 1, Concat, [1]],                     # 20 cat backbone P3
   [-1, 3, C3, [512, False]],                     # 21 (P3/8-small) 80*80

   [-1, 1, Conv, [256, 1, 1]],                    # 22   80*80
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 23
   [[-1, 3], 1, Concat, [1]],                     # 24 cat backbone P2
   [-1, 3, C3, [256, False]],                     # 25 160*160

   [-1, 1, Conv, [256, 3, 1]],                    # 26  160*160
   [-1,1,space_to_depth,[1]],                     # 27 -P2/4 80*80
   [[-1, 22], 1, Concat, [1]],                    # 28 cat head P4 80*80
   [-1, 3, C3, [256, False]],                     # 29 (P4/16-medium) 80*80

   [-1, 1, Conv, [256, 3, 1]],                    # 30 80*80
   [-1,1,space_to_depth,[1]],                     # 31 -P2/4 40*40
   [[-1, 18], 1, Concat, [1]],                    # 32 cat head P5 40*40
   [-1, 3, C3, [512, False]],                     # 33 (P5/32-large) 40*40

   [-1, 1, Conv, [512, 3, 1]],                    # 34 40*40
   [-1, 1, space_to_depth, [1]],                  # 35 -P2/4 20*20
   [[-1, 14], 1, Concat, [1]],                    # 36 cat head P6 20*20
   [-1, 3, C3, [1024, False]],                    # 37 20*20

   [[25, 29, 33, 37], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]