#Parameters
nc: 1  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.75  # layer channel multiple
anchors:
#  - [5,6, 8,14, 15,11]  #4
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

backbone:
  # [from, number, module, args]
  # Shuffle_Block: [out, stride]
  [[ -1, 1, CBRM, [ 32 ] ], # 0-P2/4
#   [ -1, 3, C3, [ 128, False] ],  # 1 160*160
#   [ -1, 3, shuffle_Block, [ 128, 1 ] ],  # 1 160*160
   [ -1, 1, Shuffle_Block, [ 128, 2 ] ],  # 1-P3/8
   [ -1, 3, Shuffle_Block, [ 128, 1 ] ],  # 2 80*80
   [ -1, 1, Shuffle_Block, [ 256, 2 ] ],  # 3-P4/16
   [ -1, 7, Shuffle_Block, [ 256, 1 ] ],  # 4 40*40
   [ -1, 1, Shuffle_Block, [ 512, 2 ] ],  # 5-P5/32
   [ -1, 3, Shuffle_Block, [ 512, 1 ] ],  # 6 20*20
  ]

#head
head:
  [[-1, 1, Conv, [256, 1, 1]],                    # 7   20*20          [512, 256, 1, 1]
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 8
   [[-1, 4], 1, Concat, [1]],                     # 9 cat backbone P4
   [-1, 1, C3, [256, False]],                     # 10  40*40

   [-1, 1, Conv, [128, 1, 1]],                    # 11   40*40
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 12
   [[-1, 2], 1, Concat, [1]],                     # 13 cat backbone P3
   [-1, 1, C3, [128, False]],                     # 14 (P3/8-small) 80*80

   [-1, 1, Conv, [128, 3, 1]],                    # 15 80*80
   [-1,1,space_to_depth,[1]],                     # 16 -P2/4 40*40
   [[-1, 11], 1, Concat, [1]],                    # 17 cat head P5 40*40
   [-1, 1, C3, [256, False]],                     # 18 (P5/32-large) 40*40

   [-1, 1, Conv, [256, 3, 1]],                    # 19 40*40
   [-1, 1, space_to_depth, [1]],                  # 20 -P2/4 20*20
   [[-1, 7], 1, Concat, [1]],                    # 21 cat head P6 20*20
   [-1, 1, C3, [512, False]],                    # 22 20*20

   [[14, 18, 22], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]