# YOLOv5 ?? by Ultralytics, GPL-3.0 license

# Parameters
nc: 1  # number of classes
depth_multiple: 0.67  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [5,6, 8,14, 15,11]  #4
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  # Shuffle_Block: [out, stride]
  [[ -1, 1, CBRM, [ 32 ] ], # 0-P2/4
#   [ -1, 1, Shuffle_Block_Lite, [ 64, 1 ] ],
   [ -1, 1, SBLL, [ 128, 2 ] ],  # 1-P3/8
   [ -1, 3, SBLL, [ 128, 1 ] ],  # 2
   [ -1, 1, SBLL, [ 256, 2 ] ],  # 3-P4/16
   [ -1, 7, SBLL, [ 256, 1 ] ],  # 4
   [ -1, 1, SBLL, [ 512, 2 ] ],  # 5-P5/32
   [ -1, 3, SBLL, [ 512, 1 ] ],  # 6
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, GSConv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P4
   [-1, 1, VoVGSCSP, [256, False]],  # 10

   [-1, 1, GSConv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P3
   [-1, 1, VoVGSCSP, [256, False]],  # 14 (P3/8-small)

   [-1, 1, GSConv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 0], 1, Concat, [1]],  # cat backbone P2
   [-1, 1, VoVGSCSP, [128, False]], # 18

   [-1, 1, GSConv, [128, 3, 2]],
   [[-1, 15], 1, Concat, [1]],  # cat head P3
   [-1, 1, VoVGSCSP, [128, False]],# 21

   [-1, 1, GSConv, [128, 3, 2]],
   [[-1, 11], 1, Concat, [1]],  # cat head P4
   [-1, 1, VoVGSCSP, [256, False]],  # 24 (P4/16-medium)

   [-1, 1, GSConv, [256, 3, 2]],
   [[-1, 7], 1, Concat, [1]],  # cat head P5
   [-1, 1, VoVGSCSP, [512, False]],  # 27 (P5/32-large)

   [[18, 21, 24, 27], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
